#ifndef INCLUDED_GAME
#define	INCLUDED_GAME

//******************************************************************************
//
//
//      ゲームシーン
//
//
//******************************************************************************

//==============================================================================
//
//      Gameクラス
//
//==============================================================================

class Game : public Scene
{
public:
    static Game* instance() { return &instance_; }

    void init();
    void deinit();
    void update();
    void draw();

    BG* bg() { return bg_; }   //bg_のゲッター

private:
    bool                isPaused;
    BG*                 bg_;   //背景を管理するようの変数

    static Game instance_;
};



//******************************************************************************

#endif // !INCLUDED_GAME
