//******************************************************************************
//
//
//      シ?ン管理
//
//
//******************************************************************************

//------< インクル?ド >---------------------------------------------------------
#include "all.h"

//==============================================================================
//
//      Sceneクラス
//
//==============================================================================

//--------------------------------
//  実行
//--------------------------------
Scene* Scene::execute()
{
    using namespace GameLib;

    // 初期化処理
    init();

    // ゲ??ル?プ
    while (GameLib::gameLoop(false))    // falseをtrueにすると?イトルバ?にフレ??レ?ト?示
    {
        // 入力処理
        input::update();

        // 更新処理
        update();

        // ?画処理
        draw();

        // デバッグ文字列の?画
        debug::display(1, 1, 1, 1, 1);
        //debug::setString("GP2_01 SAMPLE");

        // 画面フリップ
        GameLib::present(1, 0);

        // 終了?ェック
        if (nextScene) break;
    }

    // 終了処理
    deinit();

    return nextScene;	// 次のシ?ンを返す
}

//******************************************************************************
//
//      SceneManagerクラス
//
//******************************************************************************

//--------------------------------
//  実行
//--------------------------------
void SceneManager::execute(Scene* scene)
{
    using namespace GameLib;

   // bool isFullScreen = true;	// フルスクリ?ンにするならtrueに変える
                                //（Releaseモ?ドのみ）

    // ゲ??ライブラリの初期化処理
    GameLib::init(L"Makeover Girl", 
        1920, 1090, true);

#ifndef _DEBUG
    ShowCursor(!isFullScreen);	// フルスクリ?ン時はカ??ルを消す
#endif

    // メインル?プ
    while (scene)
    {
        scene = scene->execute();
    }

    // ゲ??ライブラリの終了処理
    GameLib::uninit();
}

//******************************************************************************
