#ifndef INCLUDED_USER
#define INCLUDED_USER

//******************************************************************************
//
//
//      ユーザー（ユーティリティー）
//
//
//******************************************************************************

//------< インクルード >--------------------------------------------------------
#include <sstream>
#include <bitset>

//------< inline function >-----------------------------------------------------

//------------------------------------------------------
//  整数を2進数（16bit）のstringに変換する
//------------------------------------------------------
//  const int n     変換する整数
//------------------------------------------------------
//  戻り値：std::string     数値を2進数に変換したもの(string)
//------------------------------------------------------
inline std::string strBit16(const int n)
{
    std::stringstream ss;
    ss << static_cast<std::bitset<16>>(n);
    return ss.str();
}

#endif // !INCLUDED_USER
